package resource

import (
	"fmt"
)

type petTravelStruct struct {
	Name      string //家具
	Type      string //家具类型
	Watch     string //观赏
	Practical string //实用
	Strong    string //坚固
	Natural   string //风水
	Interest  string //趣味
}

var petTravel = map[string]petTravelStruct{
	"万花": {
		"日晷", "景观-雕像", "484", "1743", "500", "500", "---",
	},
	"少林": {
		"七层浮屠", "景观-摆件", "166", "172", "172", "599", "---",
	},
	"扬州": {
		"九州港彩釉缸", "家具-小玩意", "10", "4", "4", "4", "4",
	},
	"纯阳": {
		"银平脱灯笼", "家具-灯笼", "61", "---", "---", "184", "---",
	},
	"洛阳": {
		"铜镜", "家具-小玩意", "---", "4", "4", "---", "21",
	},
	"洛道": {
		"黄泉·七", "景观-特效", "51", "---", "---", "155", "---",
	},
	"寇岛": {
		"巨型毒伞菌", "景观-雕像", "193", "---", "---", "193", "904",
	},
	"天策": {
		"北邙忆灯笼", "家具-灯笼", "36", "172", "36", "---", "---",
	},
	"枫华谷": {
		"一盆蓼蓝", "家具-用具", "1", "1", "1", "1", "1",
	},
	"金水镇": {
		"瓠勺", "家具-用具", "5", "12", "5", "5", "5",
	},
	"长安": {
		"孔方摆件", "景观-雕像", "71", "71", "71", "159", "71",
	},
	"七秀": {
		"蔑编竹篮·一", "家具-用具", "1", "1", "1", "1", "1",
	},
	"巴陵县": {
		"越窑香插", "家具-小玩意", "4", "4", "---", "10", "4",
	},
	"南屏山": {
		"黄杨根", "景观-其他", "---", "---", "---", "---", "---",
	},
	"龙门荒漠": {
		"歌朵兰漠仙人掌", "景观-灌木", "19", "19", "---", "19", "44",
	},
	"浩气盟": {
		"黄泉·三", "景观-特效", "49", "---", "---", "148", "---",
	},
	"恶人谷": {
		"黄泉·一", "景观-特效", "49", "---", "---", "148", "---",
	},
	"昆仑": {
		"昆山焰晶", "景观-摆件", "1942", "---", "---", "416", "416",
	},
	"瞿塘峡": {
		"苗疆菇群", "景观-灌木", "19", "19", "---", "66", "18",
	},
	"藏剑山庄": {
		"西湖石剑", "景观-雕像", "---", "904", "193", "193", "---",
	},
	"白龙口": {
		"兽面纹黄铜鼎", "家具-雕像", "193", "200", "200", "697", "---",
	},
	"无量山": {
		"苗石山羊头", "家具-挂墙", "124", "---", "581", "---", "124",
	},
	"五毒": {
		"苗疆铁质大药炉", "景观-摆件", "---", "310", "66", "66", "---",
	},
	"融天岭": {
		"蔓墙藤", "家具-挂墙", "567", "121", "---", "121", "---",
	},
	"黑龙沼": {
		"乌路蛇石像", "景观-雕像", "484", "500", "500", "1743", "---",
	},
	"苍山洱海": {
		"山城玉象饰件", "景观-雕像", "2260", "484", "---", "---", "484",
	},
	"成都": {
		"鸟巢", "家具-小玩意", "4", "4", "11", "4", "4",
	},
	"唐门": {
		"毛竹春笋", "景观-灌木", "19", "19", "---", "18", "66",
	},
	"枫华谷·战乱": {
		"黍离悲", "家具-庭灯", "78", "78", "177", "78", "78",
	},
	"明教": {
		"黄杨根药臼", "景观-摆件", "---", "832", "---", "---", "277",
	},
	"洛阳·战乱": {
		"越窑卷草纹卧炉", "家具-小玩意", "4", "4", "4", "4", "11",
	},
	"马嵬驿": {
		"闲散客", "景观-摆件", "166", "---", "777", "166", "---",
	},
	"长安·战乱": {
		"堕凡尘", "景观-雕像", "484", "---", "---", "484", "2260",
	},
	"天策·战乱": {
		"陶药炉", "景观-摆件", "---", "333", "---", "---", "111",
	},
	"丐帮": {
		"一坛老酒", "家具-用具", "14", "66", "---", "---", "14",
	},
	"长安内城": {
		"晾衣架·三", "景观-其他", "---", "---", "---", "---", "---",
	},
	"苍云": {
		"海龟甲", "景观-摆件", "71", "71", "71", "71", "159",
	},
	"太原": {
		"柳氏石柱", "景观-雕塑", "201", "201", "453", "201", "201",
	},
	"长歌门": {
		"佳曲三弄", "景观-摆件", "416", "---", "---", "416", "1942",
	},
	"五台山": {
		"天竺式香浮屠", "景观-摆件", "---", "166", "---", "166", "777",
	},
	"千岛湖": {
		"臈缬宝相花灯笼", "家具-灯笼", "39", "39", "88    39", "39", "39",
	},
	"阴山大草原": {
		"青竹仿杓", "景观-其他", "---", "---", "---", "---", "---",
	},
	"黑戈壁": {
		"苗石鹿头", "家具-挂墙", "---", "---", "581", "124", "124",
	},
	"洛阳城北": {
		"榧木壁灯", "家具-灯笼", "38", "---", "36", "132", "38",
	},
	"霸刀山庄": {
		"青铜阔刀", "景观-摆件", "---", "66", "310", "---", "66",
	},
	"洞天福地岛": {
		"东瀛文立牌", "景观-其他", "---", "---", "---", "---", "---",
	},
	"龙泉府": {
		"兽牙坠饰", "家具-小玩意", "---", "---", "230", "76", "---",
	},
	"九寨沟": {
		"云山图", "家具-挂墙", "12", "12", "---", "56", "---",
	},
	"侠客岛": {
		"东海珠蚌", "景观-摆件", "777", "166", "166", "---", "---",
	},
	"蓬莱": {
		"黄杨根灯檠", "家具-摆灯", "---", "55", "258", "---", "55",
	},
	"经首道源岛": {
		"了无挂碍图", "家具-挂墙", "51", "116", "51", "51", "51",
	},
	"鲲鹏岛": {
		"兽面纹铜卧炉", "家具-小玩意", "31", "---", "---", "---", "31",
	},
	"凌雪阁": {
		"黄泉·八", "景观-特效", "51", "---", "---", "155", "---",
	},
	"蔷薇列岛": {
		"琉球社灯檠", "景观-庭灯", "73", "344", "---", "73", "---",
	},
}

func SearchPetTravel(address string) string {
	data, empty := petTravel[address]
	if empty != false {
		return fmt.Sprintf("器物：%s \n"+
			"地图：%s \n"+
			"类型：%s \n"+
			"观赏：%s \n"+
			"实用：%s \n"+
			"坚固：%s \n"+
			"风水：%s \n"+
			"趣味：%s", data.Name, address, data.Type, data.Watch, data.Practical, data.Strong, data.Natural, data.Interest)
	}
	return "没查询到嗷！"

}
